;---------------------------------------------------------------------------------------
;  FILE:   XcomLoco                                  
;  
;	File created by RustyDios	24/11/19	02:45
;	LAST UPDATED				08/03/21	16:00
;
;	Xenolator descriptions
;
;*******************************************************************************************

;*********************
;Abilities - Adjusted
;*********************

[MZFireThrowerOverwatchShot X2AbilityTemplate]
LocFriendlyName="Overwatch Immolator"

[MZChemthrowerSuppresion X2AbilityTemplate]
LocFriendlyName="Chemthrower Suppression"

[MZChemthrowerKillZoneShot X2AbilityTemplate]
LocFriendlyName="Chemthrower KillZone"

;********************
;Abilities - New
;********************

[RDThrowerShot_Fire X2AbilityTemplate]
LocFriendlyName="Fire Xenolator"
LocLongDescription="Expel a stream of highly flammable chemicals, burning and damaging multiple targets."
LocHelpText="Expel a stream of highly flammable chemicals, burning and damaging multiple targets."
LocFlyOverText="Fire Xenolator"
LocPromotionPopupText="<Bullet/>Expel a stream of highly flammable chemicals, burning and damaging multiple targets."

[RDThrowerShot_Acid X2AbilityTemplate]
LocFriendlyName="Fire Corrolator"
LocLongDescription="Expel a stream of highly corrosive chemicals, burning and shredding multiple targets."
LocHelpText="Expel a stream of highly corrosive chemicals, burning and shredding multiple targets."
LocFlyOverText="Fire Corrolator"
LocPromotionPopupText="<Bullet/>Expel a stream of highly corrosive chemicals, burning and shredding multiple targets."

[RDThrowerShot_Poison X2AbilityTemplate]
LocFriendlyName="Fire Toxilator"
LocLongDescription="Expel a stream of highly toxic chemicals, poisoning multiple targets. Pierces armor."
LocHelpText="Expel a stream of highly toxic chemicals, poisoning multiple targets. Pierces armor"
LocFlyOverText="Fire Toxlator"
LocPromotionPopupText="<Bullet/>Expel a stream of highly toxic chemicals, poisoning multiple targets. Pierces armor."

[RDThrowerOverwatchShot_Fire X2AbilityTemplate]
LocFriendlyName="Overwatch Xenolator"

[RDThrowerOverwatchShot_Acid X2AbilityTemplate]
LocFriendlyName="Overwatch Corrolator"

[RDThrowerOverwatchShot_Poison X2AbilityTemplate]
LocFriendlyName="Overwatch Toxilator"

[RDChemstorm_Acid X2AbilityTemplate]
LocFriendlyName="Acid Storm"
LocLongDescription="Use the <Ability:WeaponName/> to attack all units in a complete circle around the <Ability:ClassName/>'s position."
LocHelpText="Use the <Ability:WeaponName/> to attack all units in a complete circle around the <Ability:ClassName/>'s position."
LocFlyOverText="Acid Storm"
LocPromotionPopupText="<Bullet/>Use the <Ability:WeaponName/> to attack all units in a complete circle around the <Ability:ClassName/>'s position.<br/><Bullet/>Costs <Ability:CHEMSTORM_AMMO/> Ammo.<br/><Bullet/>Has a <Ability:CHEMSTORM_COOL/> round cooldown.<br/><Bullet/>Has a range of <Ability:CHEMSTORM_RADIUS/> tiles."

[RDChemstorm_Poison X2AbilityTemplate]
LocFriendlyName="Toxic Storm"
LocLongDescription="Use the <Ability:WeaponName/> to attack all units in a complete circle around the <Ability:ClassName/>'s position."
LocHelpText="Use the <Ability:WeaponName/> to attack all units in a complete circle around the <Ability:ClassName/>'s position."
LocFlyOverText="Toxic Storm"
LocPromotionPopupText="<Bullet/>Use the <Ability:WeaponName/> to attack all units in a complete circle around the <Ability:ClassName/>'s position.<br/><Bullet/>Costs <Ability:CHEMSTORM_AMMO/> Ammo.<br/><Bullet/>Has a <Ability:CHEMSTORM_COOL/> round cooldown.<br/><Bullet/>Has a range of <Ability:CHEMSTORM_RADIUS/> tiles."

[XENOLATOR_Directed X2AbilityTemplate]
LocFriendlyName="Directed Jet"
LocLongDescription="Shoot flames in a directed line. This directed line of flame will deal severe burns and deal higher damage over time."
LocHelpText="Shoot flames in a directed line. This directed line of flame will deal severe burns and deal higher damage over time."
LocFlyOverText="Directed Flame"

[XENOLATOR_FlameArea X2AbilityTemplate]
LocFriendlyName="Wide Burst"
LocLongDescription="Spray flames in a short compact area. Build a wall of flame to keep enemies away."
LocHelpText="Spray flames in a short compact area. Build a wall of flame to keep enemies away."
LocFlyOverText="Wide Burst"

[XENOLATOR_ArcCutter X2AbilityTemplate]
LocFriendlyName="Arc Cutter"
LocLongDescription="Uses the <Ability:WeaponName/> to shred armour while adding burning damage to the target.\nDeals extra damage to robotic units and a chance to force shut down."
LocHelpText="Uses the <Ability:WeaponName/> to shred armour while adding burning damage to the target.\nDeals extra damage to robotic units and a chance to force shut down."
LocFlyOverText="Arc Cutter"

;**********
; Weapons
;**********

[XCOM_Xenolator_CV X2WeaponTemplate]
FriendlyName="Basic Xenolator"
FriendlyNamePlural="Basic Xenolators"
BriefSummary="This basic chemical thrower fires a stream of highly flamable chemicals, burning and damaging multiple targets."
TacticalText="<Bullet/> Chemthrowers do low damage in a wide area, making them effective only when dealing with multiple targets.<br> <Bullet/> The Xenolator will always burn targets, dealing damage over time and disabling some abilities.<br> <Bullet/> Some enemies may be immune to fire, and take no damage from the Xenolator.<br> <Bullet/> Extremely effective against the Lost.<br>"
AbilityDescName="Xenolator"

[XCOM_Xenolator_MG X2WeaponTemplate]
FriendlyName="Advanced Xenolator"
FriendlyNamePlural="Advanced Xenolators"
BriefSummary="This advanced chemical thrower fires a stream of highly flamable chemicals, burning and damaging multiple targets."
TacticalText="<Bullet/> Chemthrowers do low damage in a wide area, making them effective only when dealing with multiple targets.<br> <Bullet/> The Xenolator will always burn targets, dealing damage over time and disabling some abilities.<br> <Bullet/> Some enemies may be immune to fire, and take no damage from the Xenolator.<br> <Bullet/> Extremely effective against the Lost.<br>"
AbilityDescName="Xenolator"

[XCOM_Xenolator_BM X2WeaponTemplate]
FriendlyName="Superior Xenolator"
FriendlyNamePlural="Superior Xenolators"
BriefSummary="This superior chemical thrower fires a stream of highly flamable chemicals, burning and damaging multiple targets."
TacticalText="<Bullet/> Chemthrowers do low damage in a wide area, making them effective only when dealing with multiple targets.<br> <Bullet/> The Xenolator will always burn targets, dealing damage over time and disabling some abilities.<br> <Bullet/> Some enemies may be immune to fire, and take no damage from the Xenolator.<br> <Bullet/> Extremely effective against the Lost.<br>"
AbilityDescName="Xenolator"

[XCOM_Xenolator_AC X2WeaponTemplate]
FriendlyName="Superior Corrolator"
FriendlyNamePlural="Superior Corrolators"
BriefSummary="This unique chemical thrower fires a stream of highly corrosive chemicals, burning and damaging multiple targets."
TacticalText="<Bullet/> Chemthrowers do low damage in a wide area, making them effective only when dealing with multiple targets.<br> <Bullet/> The Corrolator will always burn targets, dealing damage over time and shredding armor.<br> <Bullet/> Some enemies may be immune to acid, and take no damage from the Corrolator.<br> <Bullet/>This chemthrower is extremely hard to handle, the effect may reach unintended areas.<br>"
AbilityDescName="Corrolator"

[XCOM_Xenolator_PO X2WeaponTemplate]
FriendlyName="Superior Toxilator"
FriendlyNamePlural="Superior Toxilators"
BriefSummary="This unique chemical thrower fires a stream of highly toxic chemicals, poisoning and damaging multiple targets."
TacticalText="<Bullet/> Chemthrowers do low damage in a wide area, making them effective only when dealing with multiple targets.<br> <Bullet/> The Toxilator will always poison targets, dealing damage over time and ignores armor.<br> <Bullet/> Some enemies may be immune to poison, and take no damage from the Toxilator.<br> <Bullet/>This chemthrower is extremely hard to handle, the effect may reach unintended areas.<br>"
AbilityDescName="Toxilator"

;**********
; Techs
;**********
[ExperimentalChemthrower X2TechTemplate]
DisplayName="Experimental Chemthrower"
CodeName="Rustolators"
Summary="We may have seen the aliens and ADVENT use some exotic chemicals in their weapons. With our current experience in making and modifying weapons, we could develop new types of chemthrowers that will be different to the default model.\nThese new chemthrowers will be based on fire, ice, poison or acid.\n\n<font color = '#5CC3C1'>*****</font>\n<font color = '#5CC3C1'>Bitterfrost Protocol required for a Cryolator.</font>"
LongDescription="We may have seen the aliens and ADVENT use some exotic chemicals in their weapons. With our current experience in making and modifying weapons, we could develop new types of chemthrowers that will be different to the default model.\nThese new chemthrowers will be based on fire, ice, poison or acid.\n\n<font color = '#5CC3C1'>*****</font>\n<font color = '#5CC3C1'>Bitterfrost Protocol required for a Cryolator.</font>"
UnlockedDescription="We could attempt modifications to our Chemthrowers to create elemental variations"

[ExperimentalCanisters X2TechTemplate]
DisplayName="Experimental Canister"
CodeName="Rusty Cans"
Summary="We may have seen the aliens and ADVENT use some exotic chemicals in their weapons. With our current experience in making and modifying weapons, we could develop new types of canisters that will be different to the default model.\nThese new canisters will be based on fire, ice, poison, acid, electric, psionic, explosives, smoke or medical.\n\n<font color = '#5CC3C1'>*****</font>\n<font color = '#5CC3C1'>Bitterfrost Protocol required for a Ice Canister.</font>"
LongDescription="We may have seen the aliens and ADVENT use some exotic chemicals in their weapons. With our current experience in making and modifying weapons, we could develop new types of canisters that will be different to the default model.\nThese new canisters will be based on fire, ice, poison, acid, electric, psionic, explosives, smoke or medical.\n\n<font color = '#5CC3C1'>*****</font>\n<font color = '#5CC3C1'>Bitterfrost Protocol required for a Ice Canister.</font>"
UnlockedDescription="We could attempt modifications to our Canisters to create elemental variations"

;*******
; PGOv2
;*******
[MZBlastCanister_UnlockTech X2TechTemplate]
DisplayName="Experimental Canister: Blast"
Summary="We made a varient canister."

[MZFireCanister_UnlockTech X2TechTemplate]
DisplayName="Experimental Canister: Fire"
Summary="We made a varient canister."

[MZIceCanister_UnlockTech X2TechTemplate]
DisplayName="Experimental Canister: Ice"
Summary="We made a varient canister."

[MZPoisonCanister_UnlockTech X2TechTemplate]
DisplayName="Experimental Canister: Poison"
Summary="We made a varient canister."

[MZAcidCanister_UnlockTech X2TechTemplate]
DisplayName="Experimental Canister: Acid"
Summary="We made a varient canister."

[MZCurseCanister_UnlockTech X2TechTemplate]
DisplayName="Experimental Canister: Psi Curse"
Summary="We made a varient canister."

[MZSmokeCanister_UnlockTech X2TechTemplate]
DisplayName="Experimental Canister: Smoke"
Summary="We made a varient canister."

[MZMedicCanister_UnlockTech X2TechTemplate]
DisplayName="Experimental Canister: Medical"
Summary="We made a varient canister."

[MZBluescreenCanister_UnlockTech X2TechTemplate]
DisplayName="Experimental Canister: EMP Bluescreen"
Summary="We made a varient canister."

[XCOM_Xenolator_BM_UnlockTech X2TechTemplate]
DisplayName="Experimental Chemthrower: Xenolator"
Summary="We made a varient chemthower."

[XCOM_Xenolator_PO_UnlockTech X2TechTemplate]
DisplayName="Experimental Chemthrower: Toxilator"
Summary="We made a varient chemthower."

[XCOM_Xenolator_AC_UnlockTech X2TechTemplate]
DisplayName="Experimental Chemthrower: Corrolator"
Summary="We made a varient chemthower."

[XcomCryolator_BM_UnlockTech X2TechTemplate]
DisplayName="Experimental Chemthrower: Cryolator"
Summary="We made a varient chemthower."
